In [2]:
#%matplotlib inline  # ipython magic command

import pandas as pd  # for tabular processing
import numpy as np  # for numeric processing

import matplotlib.pyplot as plt  # for plotting

## create

In [3]:
data = [{'mouse': 'SOM-cre-0323', 'weight':23.3, 'date': '2019-03-21'}, 
        {'mouse': 'SOM-cre-0323', 'weight':27.3, 'date': '2019-03-22'}, 
        {'mouse': 'SOM-cre-0323', 'weight':32.3, 'date': '2019-03-23'}]

df = pd.DataFrame(data)
df.head()

         date         mouse  weight
0  2019-03-21  SOM-cre-0323    23.3
1  2019-03-22  SOM-cre-0323    27.3
2  2019-03-23  SOM-cre-0323    32.3

In [4]:
df.to_csv('demo.csv', index=False)  # export tabular data to csv file.

## read in

In [6]:
# import data and preview
sheet = pd.read_csv("./Titanic.csv")

sheet.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
# an overview

## histogram
sheet.Age.hist()

## check unique values
sheet.Pclass.unique()

array([3, 1, 2])

In [12]:
# filtering or querying

subsheet = sheet[(sheet.Age < 30) & (sheet.Age > 20) &
                 (sheet.Sex == 'female') & (sheet.Survived == 1) &
                 (sheet.Pclass == 1) & (sheet.SibSp == 0)]
subsheet.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
290,291,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0,0,0,19877,78.8500,NaN,S
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C
356,357,1,1,"Bowerman, Miss. Elsie Edith",female,22.0,0,1,113505,55.0000,E33,S
369,370,1,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,PC 17477,69.3000,B35,C
539,540,1,1,"Frolicher, Miss. Hedwig Margaritha",female,22.0,0,2,13568,49.5000,B39,C

In [13]:
# grouping (cf. R)

_group = sheet.groupby('Pclass')
_group.mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        672.492260  0.575851  39.159930  0.436533  0.365325  87.508992
2        671.566787  0.422383  29.506705  0.393502  0.368231  21.179196
3        640.558533  0.269394  24.816367  0.568406  0.400564  13.302889

In [17]:
# selecting specific row using local index
subsheet.iloc[0].Name

# selecting specific row using original index
subsheet.loc[290]

'Barber, Miss. Ellen "Nellie"'

In [22]:
subsheet.Age.values

array([26., 24., 22., 24., 22., 21., 24., 22., 24., 29., 22., 23., 29.,
       21., 22.])

In [ ]:
# get specific value
sheet.Name[4]
sheet['Name'][4]